# Add leading zeros to a series of numbers

In [1]:
import pandas as pd

Start with a list of tuples containing **Employee Name** and **Employee ID**

In [2]:
employees = [('dave',12554), ('kevin',54321), ('rachel', 3256), ('tamara', 125557)]

Create a dataframe

In [3]:
df = pd.DataFrame(employees, columns=['EmpName','EmpID']);
df

  EmpName   EmpID
0    dave   12554
1   kevin   54321
2  rachel    3256
3  tamara  125557

First, convert the **Employee ID** to a string with the `astype()` method.  

Then use the `str.rjust()` method to create a string of 7 characters with '0' as the fill.

In [4]:
df.EmpID = df.EmpID.astype('str').str.rjust(7, '0');
df

  EmpName    EmpID
0    dave  0012554
1   kevin  0054321
2  rachel  0003256
3  tamara  0125557

And, just because, we can capitalize the employee's name with the `str.title()` method.

In [5]:
df.EmpName = df.EmpName.str.title();
df

  EmpName    EmpID
0    Dave  0012554
1   Kevin  0054321
2  Rachel  0003256
3  Tamara  0125557